/*
*********************************************************************************************************
*	                                  
*	模块名称 : 延时函数模块
*	文件名称 : delay.h
*	版    本 : V1.3
*	说    明 : 头文件
*********************************************************************************************************
*/

#ifndef __DELAY_H
#define __DELAY_H 			   
#include <sys.h>	  

void delay_init(u8 SYSCLK);
void delay_us(u32 nus);
void delay_ms(u32 nms);
void delay_xms(u32 nms);
#endif
