/*
*********************************************************************************************************
*	                                  
*	模块名称 : 硬件初始化模块
*	文件名称 : system.c
*	版    本 : V1.3
*	说    明 : 硬件初始化模块
*
*
*********************************************************************************************************
*/

#include "system.h"	

/*
*********************************************************************************************************
*	函 数 名: systemInit
*	功能说明: 底层硬件初始化
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void systemInit(void)
{
	u8 i=0;	
	nvicInit();		
	//extiInit();		
	delay_init(168);	
	uartGpsInit();
	uartHmiInit();
	LED_Init();
	BEEP_Init();
	relayInit();
	delay_ms(200);
	HMISendstart();

	for(i=0;i<4;i++){BEEP=!BEEP;delay_ms(250);}
	maslinkInit();
	atkpInit();
	
}
